---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ScheduleSortGroupField Constructor
ScheduleSortGroupField Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | ScheduleSortGroupField()()()() | Creates a new ScheduleSortGroupField. |
|  | ScheduleSortGroupField(ScheduleFieldId) | Creates a new ScheduleSortGroupField. |
|  | ScheduleSortGroupField(ScheduleFieldId, ScheduleSortOrder) | Creates a new ScheduleSortGroupField. |

# See Also

ScheduleSortGroupField Class

ScheduleSortGroupField Members

Autodesk.Revit.DB Namespace